# DpartLayerFunction Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..DpartLayerFunction Property
ParameterTypeId Class See Also
---
"Layer Function"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId DpartLayerFunction { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DpartLayerFunction As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DpartLayerFunction {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace